conf/data.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:urn="urn:siemens:names:prov:gw:SPML:2:0">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <urn:searchRequest xmlns:spml="urn:siemens:names:prov:gw:SPML:2:0"
                           xmlns:subscriber="urn:siemens:names:prov:gw:HLR_EPS_SUBSCRIBER:5:0"
                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <version>HLR_EPS_SUBSCRIBER_v50</version>
            <base>
                <objectclass>Subscriber</objectclass>
                <alias name="imsi" value="525034375217101"/>
            </base>
            <returnAttribute>hlr</returnAttribute>
        </urn:searchRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>