getImsiInfoRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:siemens:names:prov:gw:SPML:2:0">
    <soapenv:Header/>
    <soapenv:Body>
        <spml:searchRequest
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                xmlns:subscriber="urn:siemens:names:prov:gw:SUBSCRIBER:1:0"
                xmlns:spml="urn:siemens:names:prov:gw:SPML:2:0">
            <version>SUBSCRIBER_v10</version>
            <base>
                <objectclass>Subscriber</objectclass>
                <alias name="imsi" value="$imsi$"/>
            </base>
            <returnAttribute>hlr</returnAttribute>
        </spml:searchRequest>


    </soapenv:Body>
</soapenv:Envelope>